tap "harryzcy/ascheck"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/azdata-cli-release"
tap "microsoft/mssql-release"
tap "mistertea/et"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "rbenv/tap"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Emacs dependency management
brew "cask"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# IMAP/POP3 server
brew "dovecot"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Feature-rich console based todo list manager
brew "task"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Command-line time tracking application
brew "timewarrior"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Command-line app that checks all of your apps for their Apple Silicon support
brew "harryzcy/ascheck/ascheck"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql17"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# Remote terminal with IP roaming
brew "mistertea/et/et"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Bible study software
cask "accordance"
# Instant messaging application
cask "adium"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# GPU-accelerated terminal emulator
cask "alacritty"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Manage team projects and tasks
cask "asana"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
# Online gaming platform
cask "battle-net"
# Army list creator for tabletop wargamers
cask "battlescribe"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Launcher for *Epic Games* games
cask "epic-games"
# EVE Online client
cask "eve-launcher"
cask "font-fira-code"
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customizer
cask "karabiner-elements"
# Sound clear in online meetings
cask "krisp"
# Support for Logitech G gear
cask "logitech-g-hub"
# Software for Logitech devices
cask "logitech-options"
# Explorer for Azure Storage
cask "microsoft-azure-storage-explorer"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Online collaborative whiteboard platform
cask "miro"
# Open-source, low-latency, high quality voice chat software for gaming
cask "mumble"
# Native code editor
cask "nova"
# Web browser
cask "opera"
# File system integration
cask "osxfuse"
# HTTP client that helps testing and describing APIs
cask "paw"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Control your tools with a few keystrokes
cask "raycast"
# Official desktop client for Rocket.Chat
cask "rocket-chat"
# Word processing software with a typewriter style
cask "scrivener"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Web browser focusing on customization and control
cask "vivaldi"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# Application for configuring a PIV-enabled YubiKey
cask "yubico-yubikey-piv-manager"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "Azure VPN Client", id: 1553936137
mas "Canary Mail", id: 1236045954
mas "Dark Reader for Safari", id: 1438243180
mas "Decked Builder", id: 406479348
mas "Deliveries", id: 924726344
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "iMovie", id: 408981434
mas "Kaleidoscope", id: 587512244
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "MoneyWiz", id: 1511185140
mas "Night Sky X", id: 475772902
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "OmniGraffle", id: 1142578753
mas "OmniOutliner", id: 1142578772
mas "OmniPlan", id: 1460319993
mas "OmSave", id: 1514795049
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Playgrounds", id: 1496833156
mas "Postico", id: 1031280567
mas "Power JSON Editor", id: 499768540
mas "Remote Desktop", id: 409907375
mas "Rested", id: 421879749
mas "Spark", id: 1176895641
mas "Swackett", id: 412558550
mas "Vimari", id: 1480933944
mas "while True: learn()", id: 1410198714
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650
