tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mistertea/et"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "rbenv/tap"
brew "coreutils"
brew "bat"
brew "diff-so-fancy"
brew "dovecot"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "jq"
brew "mas"
brew "postgresql", restart_service: true
brew "ripgrep"
brew "task"
brew "tasksh"
brew "timewarrior"
brew "tldr"
brew "tree"
brew "mistertea/et/et"
brew "qmk/qmk/qmk"
cask "1password"
cask "adium"
cask "alfred"
cask "battle-net"
cask "box-drive"
cask "dash"
cask "discord"
cask "docker"
cask "drobo-dashboard"
cask "eve-launcher"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "mumble"
cask "nova"
cask "osxfuse"
cask "paw"
cask "postman"
cask "scrivener"
cask "steam"
cask "transmit"
mas "Decked Builder", id: 406479348
mas "Deliveries", id: 924726344
mas "Kaleidoscope", id: 587512244
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "MoneyWiz 3", id: 1012291524
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager", id: 451907568
mas "Postico", id: 1031280567
mas "Power JSON Editor", id: 499768540
mas "Quip", id: 1003160018
mas "Remote Desktop", id: 409907375
mas "Rested", id: 421879749
mas "Server", id: 883878097
mas "Slack", id: 803453959
mas "Swackett", id: 412558550
